{"format": "layers-model", "generatedBy": "keras v2.16.0", "convertedBy": "TensorFlow.js Converter v4.18.0", "modelTopology": {"keras_version": "2.16.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "hidden_layer_1_20240423_124752_651651_input"}}, {"class_name": "Dense", "config": {"name": "hidden_layer_1_20240423_124752_651651", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "hidden_layer_2_20240423_124752_672016", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "output_layer_20240423_124752_672828", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "hidden_layer_1_20240423_124752_651651/kernel", "shape": [1, 3], "dtype": "float32"}, {"name": "hidden_layer_1_20240423_124752_651651/bias", "shape": [3], "dtype": "float32"}, {"name": "hidden_layer_2_20240423_124752_672016/kernel", "shape": [3, 3], "dtype": "float32"}, {"name": "hidden_layer_2_20240423_124752_672016/bias", "shape": [3], "dtype": "float32"}, {"name": "output_layer_20240423_124752_672828/kernel", "shape": [3, 1], "dtype": "float32"}, {"name": "output_layer_20240423_124752_672828/bias", "shape": [1], "dtype": "float32"}]}]}